package programmers2.hanhwalife;

// binary to ipv4
public class Quest01 {
    // 실행 메서드
    public void exec(){
        System.out.println("~~ Question 01 Start ~~");
        // variables
        String bits = "11101010000001010000100100010001";


        // solution
        System.out.println("리턴 결과 ==> " + solution(bits));
        System.out.println("\n\n~~ Question 01 End ~~\n\n");
    }

    private static String solution(String bits){


        // 솔루션 핵심은 2진수를 10진수로
        System.out.println(Integer.parseInt(bits.substring(0, 8), 2));
        System.out.println(Integer.parseInt(bits.substring(9, 16), 2));
        System.out.println(Integer.parseInt(bits.substring(17, 24), 2));
        System.out.println(Integer.parseInt(bits.substring(25, 32), 2));
        // String.format("%s.%s.%s.%", octet1, octet2, octet3, octet4);



        // #############################################################################################################
        // [초기화 및 자료형 선언]
        // #############################################################################################################
        int result = 0;


        // #############################################################################################################
        // [데이터 분해 후 재정렬]
        // #############################################################################################################


        // #############################################################################################################
        // [목적데이터 추출]
        // #############################################################################################################


        // #############################################################################################################
        // [결과 데이터 가공 후 리턴]
        // #############################################################################################################

        return "";
    }
}
