package preparing4kakaoboost.kakao2022;

//문제 4 – 양궁 대회
//정답률 : 21.16%
//문제 4 풀러가기
//
//
//문제 설명
//
//카카오배 양궁대회가 열렸습니다.
//라이언은 저번 카카오배 양궁대회 우승자이고 이번 대회에도 결승전까지 올라왔습니다. 결승전 상대는 어피치입니다. 카카오배 양궁대회 운영위원회는 한 선수의 연속 우승보다는 다양한 선수들이 양궁대회에서 우승하기를 원합니다. 따라서, 양궁대회 운영위원회는 결승전 규칙을 전 대회 우승자인 라이언에게 불리하게 다음과 같이 정했습니다.
//
//1. 어피치가 화살 n발을 다 쏜 후에 라이언이 화살 n발을 쏩니다.
//2. 점수를 계산합니다.
//
//과녁판은 아래 사진처럼 생겼으며 가장 작은 원의 과녁 점수는 10점이고 가장 큰 원의 바깥쪽은 과녁 점수가 0점입니다.
//
//만약, k(k는 1~10사이의 자연수)점을 어피치가 a발을 맞혔고 라이언이 b발을 맞혔을 경우 더 많은 화살을 k점에 맞힌 선수가 k 점을 가져갑니다. 단, a = b일 경우는 어피치가 k점을 가져갑니다. k점을 여러 발 맞혀도 k점 보다 많은 점수를 가져가는 게 아니고 k점만 가져가는 것을 유의하세요. 또한 a = b = 0 인 경우, 즉, 라이언과 어피치 모두 k점에 단 하나의 화살도 맞히지 못한 경우는 어느 누구도 k점을 가져가지 않습니다.
//* 예를 들어, 어피치가 10점을 2발 맞혔고 라이언도 10점을 2발 맞혔을 경우 어피치가 10점을 가져갑니다.
//* 다른 예로, 어피치가 10점을 0발 맞혔고 라이언이 10점을 2발 맞혔을 경우 라이언이 10점을 가져갑니다.
//모든 과녁 점수에 대하여 각 선수의 최종 점수를 계산합니다.
//
//3. 최종 점수가 더 높은 선수를 우승자로 결정합니다. 단, 최종 점수가 같을 경우 어피치를 우승자로 결정합니다.
//
//
//현재 상황은 어피치가 화살 n발을 다 쏜 후이고 라이언이 화살을 쏠 차례입니다.
//라이언은 어피치를 가장 큰 점수 차이로 이기기 위해서 n발의 화살을 어떤 과녁 점수에 맞혀야 하는지를 구하려고 합니다.
//
//화살의 개수를 담은 자연수 n, 어피치가 맞힌 과녁 점수의 개수를 10점부터 0점까지 순서대로 담은 정수 배열 info가 매개변수로 주어집니다. 이때, 라이언이 가장 큰 점수 차이로 우승하기 위해 n발의 화살을 어떤 과녁 점수에 맞혀야 하는지를 10점부터 0점까지 순서대로 정수 배열에 담아 return 하도록 solution 함수를 완성해 주세요. 만약, 라이언이 우승할 수 없는 경우(무조건 지거나 비기는 경우)는 [-1]을 return 해주세요.
//
//
//제한사항
//
//1 ≤ n ≤ 10
//info의 길이 = 11
//0 ≤ info의 원소 ≤ n
//info의 원소 총합 = n
//info의 i번째 원소는 과녁의 10 - i 점을 맞힌 화살 개수입니다. ( i는 0~10 사이의 정수입니다.)
//라이언이 우승할 방법이 있는 경우, return 할 정수 배열의 길이는 11입니다.
//0 ≤ return할 정수 배열의 원소 ≤ n
//return할 정수 배열의 원소 총합 = n (꼭 n발을 다 쏴야 합니다.)
//return할 정수 배열의 i번째 원소는 과녁의 10 - i 점을 맞힌 화살 개수입니다. ( i는 0~10 사이의 정수입니다.)
//라이언이 가장 큰 점수 차이로 우승할 수 있는 방법이 여러 가지일 경우, 가장 낮은 점수를 더 많이 맞힌 경우를 return 해주세요.
//가장 낮은 점수를 맞힌 개수가 같을 경우 계속해서 그다음으로 낮은 점수를 더 많이 맞힌 경우를 return 해주세요.
//예를 들어, [2,3,1,0,0,0,0,1,3,0,0]과 [2,1,0,2,0,0,0,2,3,0,0]를 비교하면 [2,1,0,2,0,0,0,2,3,0,0]를 return 해야 합니다.
//다른 예로, [0,0,2,3,4,1,0,0,0,0,0]과 [9,0,0,0,0,0,0,0,1,0,0]를 비교하면[9,0,0,0,0,0,0,0,1,0,0]를 return 해야 합니다.
//라이언이 우승할 방법이 없는 경우, return 할 정수 배열의 길이는 1입니다.
//라이언이 어떻게 화살을 쏘든 라이언의 점수가 어피치의 점수보다 낮거나 같으면 [-1]을 return 해야 합니다.
//
//입출력 예
//
//n	info	result
//5	[2,1,1,1,0,0,0,0,0,0,0]	[0,2,2,0,1,0,0,0,0,0,0]
//1	[1,0,0,0,0,0,0,0,0,0,0]	[-1]
//9	[0,0,1,2,0,1,1,1,1,1,1]	[1,1,2,0,1,2,2,0,0,0,0]
//10	[0,0,0,0,0,0,0,0,3,4,3]	[1,1,1,1,1,1,1,1,0,0,2]
//
//입출력 예 설명
//
//• 입출력 예 #1
//
//어피치와 라이언이 아래와 같이 화살을 맞힐 경우,
//
//과녁 점수	어피치가 맞힌 화살 개수	라이언이 맞힌 화살 개수	결과
//10	2	3	라이언이 10점 획득
//9	1	2	라이언이 9점 획득
//8	1	0	어피치가 8점 획득
//7	1	0	어피치가 7점 획득
//6	0	0
//5	0	0
//4	0	0
//3	0	0
//2	0	0
//1	0	0
//0	0	0
//어피치의 최종 점수는 15점, 라이언의 최종 점수는 19점입니다. 4점 차이로 라이언이 우승합니다.
//
//하지만, 라이언이 아래와 같이 화살을 맞힐 경우 더 큰 점수 차로 우승할 수 있습니다.
//
//과녁 점수	어피치가 맞힌 화살 개수	라이언이 맞힌 화살 개수	결과
//10	2	0	어피치가 10점 획득
//9	1	2	라이언이 9점 획득
//8	1	2	라이언이 8점 획득
//7	1	0	어피치가 7점 획득
//6	0	1	라이언이 6점 획득
//5	0	0
//4	0	0
//3	0	0
//2	0	0
//1	0	0
//0	0	0
//어피치의 최종 점수는 17점, 라이언의 최종 점수는 23점입니다. 6점 차이로 라이언이 우승합니다.
//
//따라서 [0,2,2,0,1,0,0,0,0,0,0]을 return 해야 합니다.
//
//• 입출력 예 #2
//
//라이언이 10점을 맞혀도 어피치가 10점을 가져가게 됩니다.
//따라서, 라이언은 우승할 수 없기 때문에 [-1]을 return 해야 합니다.
//
//• 입출력 예 #3
//
//어피치와 라이언이 아래와 같이 화살을 맞힐 경우,
//
//과녁 점수	어피치가 맞힌 화살 개수	라이언이 맞힌 화살 개수	결과
//10	0	1	라이언이 10점 획득
//9	0	1	라이언이 9점 획득
//8	1	2	라이언이 8점 획득
//7	2	3	라이언이 7점 획득
//6	0	0
//5	1	2	라이언이 5점 획득
//4	1	0	어피치가 4점 획득
//3	1	0	어피치가 3점 획득
//2	1	0	어피치가 2점 획득
//1	1	0	어피치가 1점 획득
//0	1	0	어피치가 0점 획득
//어피치의 최종 점수는 10점, 라이언의 최종 점수는 39점입니다. 29점 차이로 라이언이 우승합니다.
//
//하지만 라이언이 아래와 같이 화살을 맞힐 경우,
//
//과녁 점수	어피치가 맞힌 화살 개수	라이언이 맞힌 화살 개수	결과
//10	0	1	라이언이 10점 획득
//9	0	1	라이언이 9점 획득
//8	1	2	라이언이 8점 획득
//7	2	0	어피치가 7점 획득
//6	0	1	라이언이 6점 획득
//5	1	2	라이언이 5점 획득
//4	1	2	라이언이 4점 획득
//3	1	0	어피치가 3점 획득
//2	1	0	어피치가 2점 획득
//1	1	0	어피치가 1점 획득
//0	1	0	어피치가 0점 획득
//어피치의 최종 점수는 13점, 라이언의 최종 점수는 42점입니다. 이 경우도 29점 차이로 라이언이 우승합니다.
//
//하지만, 첫 번째 경우와 두 번째 경우를 비교했을 때, 두 번째 경우가 두 경우 중 가장 낮은 점수인 4점을 더 많이 맞혔기 때문에 [1,1,2,3,0,2,0,0,0,0,0]이 아닌 [1,1,2,0,1,2,2,0,0,0,0]을 return 해야 합니다.
//
//• 입출력 예 #4
//
//여러 경우 중에서 가장 낮은 점수를 가장 많이 맞힌, 10~3점을 한 발씩 맞히고 나머지 두 발을 0점에 맞히는 경우인 [1,1,1,1,1,1,1,1,0,0,2]를 return 해야 합니다.
//
//
//문제 풀이
//
//이 문제는 완전 탐색, 구현 문제입니다. 이 문제는 DFS, 비트 마스킹, 중복조합 등등 다양한 방법으로도 풀이가 가능한데요, 가장 많은 풀이가 나온 DFS를 이용한 완전 탐색으로 풀이를 진행하겠습니다.
//
//이 문제를 해결하기 위해서는 각 점수를 아예 안 맞추거나 어피치보다 1발을 더 맞히는 경우로 각 점수(10점 ~ 0점)마다 2가지(총 2048가지)를 완전 탐색하면 됩니다.
//
//예를 들어, 어피치가 [2,0,1,1,0,0,0,0,0,0,0]처럼 화살을 맞췄을 경우 라이언은 과녁 점수 10점을 3발 맞추거나 0발 맞추거나만 선택하면 됩니다. 9점~0점도 동일한 방식으로 어피치보다 1발을 더 맞추거나 아예 안 맞추도록 구현하면 되고, 중간에 화살을 다 쐈을 경우는 나머지 과녁 점수를 모두 0발 맞춘 것으로 처리하면 됩니다. 만약 1점까지 쏘고도 화살이 남았을 경우는 남은 화살을 0점에 다 쏘도록 처리할 수 있습니다. 이렇게 가능한 모든 경우를 살펴보면서 라이언과 어피치의 최대 점수 차이를 구하면 됩니다.
//
//만약 10점부터 0점까지를 0발부터 n발까지 하나씩 증가시키면서 완전탐색한다면 최악의 경우 시간 초과가 발생할 수 있는 점 유의하시길 바랍니다.
//
//중복 조합으로 푸는 경우에도 10점부터 0점까지(11가지의 경우) 총, 10발의 화살을 쏘는 게 되기 때문에 11H10 = (11 + 10 – 1) C10 = 20C10 = 184,756으로 모든 경우의 수를 확인하면서 충분히 제한 시간 안에 문제를 해결할 수 있습니다.

import java.util.Arrays;

public class problem04 {
    public void exec() {
        int[] info;
        int n;

//        info = new int[]{2,1,1,1,0,0,0,0,0,0,0}; // 어피치 득점
//        n = 5; // 화살의 수
        // [0,2,2,0,1,0,0,0,0,0,0]

//        info = new int[]{1,0,0,0,0,0,0,0,0,0,0};
//        n = 1;
        // [-1]

        info = new int[]{0,0,1,2,0,1,1,1,1,1,1};
        n = 9;
        // [1,1,2,0,1,2,2,0,0,0,0]
//
//        info = new int[]{0,0,0,0,0,0,0,0,3,4,3};
//        n = 10;
        // [1,1,1,1,1,1,1,1,0,0,2]
        solution(n, info);
        System.out.println("베스트 스코어는 " + bestScore);
        System.out.println("어피치 패턴은 >>" + Arrays.toString(this.info));
        System.out.println("베스트 패턴은 >>" + Arrays.toString(bestPattern));
    }

    // 완전탐색문제
    private int bestScore = 0;
    private int apeachScore = 0;

    private int[] info;
    private int[] recordPattern;
    private int[] bestPattern;

    public int[] solution(int n, int[] info) {
        this.info = info;
        this.recordPattern = new int[info.length];
        getMaximumScoreForWin(0, n);
        if(bestPattern == null){
            return new int[]{-1};
        } else {
            return bestPattern;
        }
    }

    int goalScore = 0;
    int currentScore = 0;
    private void getMaximumScoreForWin(int cursor, int arrows){
        // 종료조건
        if(cursor == this.info.length || arrows == 0){ // 커서가 마지막에 도착 하거나 화살을 모두 사용 하면 종료
            // 마지막에 와 있는데도 화살이 남아 있으면 마지막 행에 사용
            if( arrows > 0 ){
                recordPattern[cursor-1] += arrows;
            }
            // 내가 맞힌 타깃의 수에 따른 상대의 득점도 변경 되므로 재산출 한다.
            this.currentScore = sumScore(0);
            this.apeachScore  = sumScoreApeach(0);

            if(currentScore > apeachScore){ // 총 점 승리 여부
                if(currentScore-apeachScore > bestScore){ // 기존 최고 점수 갱신 여부
                    bestScore = currentScore-apeachScore;
                    bestPattern = Arrays.copyOf(recordPattern, recordPattern.length);
                }
                if(currentScore-apeachScore == bestScore) { // 기존 최고 점수 갱신 여부
                    if(isAvailable2Change()){ // 가장 낮은 점수의 히트 수
                        bestPattern = Arrays.copyOf(recordPattern, recordPattern.length);
                    }
                }
            }
            // 초기화.. 얘가 남아서 자꾸 다음 행에 반영됨...
            recordPattern[cursor-1] = 0;
            return;
        }
        // 이기는 조건 - info 보다 1점 더 많으면 됨
        goalScore = (this.info[cursor] + 1);
        if(arrows - goalScore >= 0){
            recordPattern[cursor] = goalScore;
            getMaximumScoreForWin(cursor + 1, (arrows - goalScore));
        }
        // 지는 조건
        recordPattern[cursor] = 0;
        getMaximumScoreForWin(cursor + 1, arrows);
    }

    // 나의 패에 따라 상대가 득점 하는 점수가 유동적으로 변화한다.
    // 나의 득점 합을 계산
    private int sumScore(int cursor){
        if(cursor > 10) return 0;
        if(this.recordPattern[cursor] > 0 && this.recordPattern[cursor] > this.info[cursor]){
            return (this.recordPattern[cursor] > this.info[cursor] ? 10 - cursor : 0) + sumScore(cursor + 1);
        } else {
            return sumScore(cursor + 1);
        }
    }

    // 어피치의 득점 합을 계산
    private int sumScoreApeach(int cursor){
        if(cursor > 10) return 0;
        if(this.info[cursor] > 0 && this.info[cursor] >= this.recordPattern[cursor]){
            return (10 - cursor) + sumScoreApeach(cursor + 1);
        } else {
            return sumScoreApeach(cursor + 1);
        }
    }

    // 바꿀수 있는지 보자
    private boolean isAvailable2Change(){
        for(int ix = 10; ix > 5; ix --){
            if(bestPattern[ix] < recordPattern[ix]){
                System.out.println(ix);
                return true;
            }
        }
        return false;
    }
}
